
/* conjunction to end a compound sentence */
" and" = "ja";

/* No comment provided by engineer. */
"\"%@\" is already in use." = "\"%@\" on jo käytössä.";

/* No comment provided by engineer. */
"%@" = "%@";

/* Account Name (Connecting) - shown for an account while it is connecting */
"%@ (Connecting)" = "%@ (Kirjaudutaan sisään)";

/* This is displayed in the message window when prompting to receive a file. The first %@ is the sender; the second %@ is the filename of the file being sent. It will be followed by buttons such as 'Save' and 'Cancel'. */
"%@ requests to send you %@" = "%1$@ haluaa lähettää sinulle tiedoston %2$@";

/* comma between actions in the events list */
"," = ",";

/* period at the end of the Events pane sentence describing actions taken for an event */
"." = ".";

/* Colon which will be appended after a label such as 'User Name', before an input field */
":" = ":";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"Account:" = "Tunnus:";

/* Label for contact alert action (e.g. Send message, Play sound, etc.) */
"Action:" = "Toiminto:";

/* No comment provided by engineer. */
"Add Account" = "Lisää tunnus";

/* No comment provided by engineer. */
"Add an action for the selected event" = "Lisää toiminto valittuun tapahtumaan";

/* No comment provided by engineer. */
"Adium provides encryption, authentication, deniability, and perfect forward secrecy over %@ via Off-the-Record Messaging (OTR). If your contact is not using an OTR-compatible messaging system, your contact will be sent a link to the OTR web site when you attempt to connect. For more information on OTR, visit http://www.cypherpunks.ca/otr/." = "Adium mahdollistaa täysin turvallisten salattujen OTR-keskusteluiden käymisen %@ tunnuksella. Jos ystävä, jonka kanssa keskustelet, ei käytä OTR-yhteensopivaa tunnusta, hänelle tullaan lähettämään linkki OTR internet sivustolle kun keskustelu aloitetaan. Saadaksesi lisää tietoja OTR-salauksesta vieraile internet sivustolla http://www.cypherpunks.ca/otr/.";

/* No comment provided by engineer. */
"Alias:" = "Nimi:";

/* No comment provided by engineer. */
"available contact" = "available contact";

/* No comment provided by engineer. */
"away contact" = "away contact";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* Cancel current account activity prefix */
"Cancel: %@" = "Peruuta: %@";

/* No comment provided by engineer. */
"Cannot open sound set" = "Äänivalikoimaa ei voida avata";

/* No comment provided by engineer. */
"Clear" = "Pyyhi";

/* No comment provided by engineer. */
"Configure the selected action" = "Mukauta valittua toimintoa";

/* Connect account prefix */
"Connect: %@" = "Kirjaa sisään: %@";

/* No comment provided by engineer. */
"contact list group" = "ystävälistan ryhmä";

/* No comment provided by engineer. */
"Custom" = "Mukautettu";

/* Button which deletes the selection */
"Delete" = "Poista";

/* New contact alert pane */
"Delete after event occurs" = "Poista tapahtuman jälkeen";

/* No comment provided by engineer. */
"Delete Event?" = "Poista tapahtuma?";

/* No comment provided by engineer. */
"Disable" = "Poista käytöstä";

/* No comment provided by engineer. */
"Disabled Accounts" = "Käytöstä poistetut tunnukset";

/* Disconnect account prefix */
"Disconnect: %@" = "Kirjaa ulos: %@";

/* Button which indicates that the editing sheet is done */
"Done" = "Valmis";

/* Button which duplicates the selection */
"Duplicate" = "Monista";

/* No comment provided by engineer. */
"Edit" = "Muokkaa";

/* No comment provided by engineer. */
"Edit Account" = "Muokkaa tunnusta";

/* No comment provided by engineer. */
"Edit Link" = "Muokkaa linkkiä";

/* No comment provided by engineer. */
"Edit presets:" = "Muuta valikoimia:";

/* Enable account prefix */
"Enable %@" = "Ota käyttöön %@";

/* Label besides the encryption preference menu */
"Encryption:" = "Salaus:";

/* Label for contact alert event (e.g. Contact signed on, Message received, etc.) */
"Event:" = "Tapahtuma:";

/* No comment provided by engineer. */
"Idle" = "Ei aktiivinen";

/* No comment provided by engineer. */
"idle contact" = "idle contact";

/* No comment provided by engineer. */
"Invalid status icon pack" = "Viallinen tilakuvakepaketti";

/* No comment provided by engineer. */
"Join" = "Liity";

/* No comment provided by engineer. */
"Join Chat" = "Liity keskusteluun";

/* Text of the typing preference checkbox in the account preferneces */
"Let others know when you are typing" = "Anna toisten nähdä kun kirjoitat viestejä";

/* Label for the login server field in the account preferences */
"Login Server:" = "Kirjautumispalvelin:";

/* No comment provided by engineer. */
"New Alert" = "Uusi ilmoitus";

/* No comment provided by engineer. */
"No compatible accounts connected" = "Ei yhteensopivia tunnuksia kirjattuna sisään";

/* No comment provided by engineer. */
"OK" = "Ok";

/* Label for the password field in the account preferences */
"Password:" = "Salasana:";

/* No comment provided by engineer. */
"Paste" = "Sijoita";

/* Label for the port field in the account preferences */
"Port:" = "Portti:";

/* No comment provided by engineer. */
"Remove the %i actions associated with this event?" = "Poista %i toimintoa tästä tapahtumasta?";

/* No comment provided by engineer. */
"Remove the selected action(s)" = "Poista valitut toiminnot?";

/* Button which renames the selection */
"Rename" = "Nimeä uudelleen";

/* No comment provided by engineer. */
"Sound set upgrade failed" = "Äänipaketin päivittäminen epäonnistui";

/* No comment provided by engineer. */
"The active status icon pack \"%@\" installed at \"%@\" is invalid.  It is missing the required status icon \"%@\".  If you received this pack from adiumxtras.com, please contact its author. Your status icon setting will be restored to the default." = "Nykyinen tilakuvakepaketti (%1$@), joka on asennettu kohteeseen \"%2$@\" on virheellinen. Se ei sisällä vaadittua kuvaketta tilalle \"%3$@\". Mikäli tämä paketti on peräisin osoitteesta adiumxtras.com, ole hyvä ja ota yhteyttä sen tekijään. Tilakuvakkeesi palautetaan vakioasetuksiin.";

/* No comment provided by engineer. */
"The characters you're entering are not valid for an account name on this service." = "Antamasi merkit eivät ole sallittuja tämän tyyppisten tunnusten nimissä.";

/* No comment provided by engineer. */
"The sound set %@ is version %i, and this version of Adium does not know how to handle that; perhaps try a later version of Adium." = "Äänipaketti %1$@ on versiota %2$@, eikä tämä Adiumin versio osaa käsitellä sitä. Ole hyvä ja varmista että sinulla on uusin versio Adiumista.";

/* No comment provided by engineer. */
"This version of Adium uses a new format for sound sets. Adium was not able to update the sound set %@ located at %@. It has been disabled." = "Tämä Adiumin versio käyttää uudenlaisia äänipaketteja. Adium ei pystynyt päivittämään äänipakettia \"%1$@\" joka sijaitsee kohteessa \"%1$@\". Äänipaketti on poistettu käytöstä.";

/* Label in front of the title for a preset */
"Title:" = "Otsikko:";

/* Label beside the 'let others know when you are typing' checkbox in the account preferences */
"Typing:" = "Kirjoittaminen:";

/* No comment provided by engineer. */
"Unknown" = "Tuntematon";

/* No comment provided by engineer. */
"User Name" = "Käyttäjän nimi";
